{"format": "graph-model", "generatedBy": "2.11.0", "convertedBy": "TensorFlow.js Converter v4.2.0", "signature": {"inputs": {"input_1": {"name": "input_1:0", "dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "-1"}, {"size": "8"}]}}, "unknown:0": {"name": "unknown:0", "dtype": "DT_RESOURCE", "tensorShape": {}, "resourceId": 392}}, "outputs": {"output_1": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "1"}]}}}}, "modelTopology": {"node": [{"name": "input_1", "op": "Placeholder", "attr": {"dtype": {"type": "DT_INT64"}, "shape": {"shape": {"dim": [{"size": "-1"}, {"size": "8"}]}}}}, {"name": "unknown", "op": "Placeholder", "attr": {"shape": {"shape": {}}, "dtype": {"type": "DT_RESOURCE"}}}, {"name": "Func/StatefulPartitionedCall/random_forest_model_1/StatefulPartitionedCall/input_control_node/_4", "op": "NoOp", "input": ["^input_1", "^unknown"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "StatefulPartitionedCall/random_forest_model_1/StatefulPartitionedCall/PartitionedCall/strided_slice/stack", "op": "Const", "input": ["^Func/StatefulPartitionedCall/random_forest_model_1/StatefulPartitionedCall/input_control_node/_4"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/random_forest_model_1/StatefulPartitionedCall/PartitionedCall/strided_slice/stack_1", "op": "Const", "input": ["^Func/StatefulPartitionedCall/random_forest_model_1/StatefulPartitionedCall/input_control_node/_4"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/random_forest_model_1/StatefulPartitionedCall/PartitionedCall/strided_slice/stack_2", "op": "Const", "input": ["^Func/StatefulPartitionedCall/random_forest_model_1/StatefulPartitionedCall/input_control_node/_4"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/random_forest_model_1/StatefulPartitionedCall/PartitionedCall/strided_slice_1/stack", "op": "Const", "input": ["^Func/StatefulPartitionedCall/random_forest_model_1/StatefulPartitionedCall/input_control_node/_4"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/random_forest_model_1/StatefulPartitionedCall/PartitionedCall/strided_slice_1/stack_1", "op": "Const", "input": ["^Func/StatefulPartitionedCall/random_forest_model_1/StatefulPartitionedCall/input_control_node/_4"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/random_forest_model_1/StatefulPartitionedCall/PartitionedCall/strided_slice_1/stack_2", "op": "Const", "input": ["^Func/StatefulPartitionedCall/random_forest_model_1/StatefulPartitionedCall/input_control_node/_4"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/random_forest_model_1/StatefulPartitionedCall/PartitionedCall/strided_slice_2/stack", "op": "Const", "input": ["^Func/StatefulPartitionedCall/random_forest_model_1/StatefulPartitionedCall/input_control_node/_4"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/random_forest_model_1/StatefulPartitionedCall/PartitionedCall/strided_slice_2/stack_1", "op": "Const", "input": ["^Func/StatefulPartitionedCall/random_forest_model_1/StatefulPartitionedCall/input_control_node/_4"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/random_forest_model_1/StatefulPartitionedCall/PartitionedCall/strided_slice_2/stack_2", "op": "Const", "input": ["^Func/StatefulPartitionedCall/random_forest_model_1/StatefulPartitionedCall/input_control_node/_4"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/random_forest_model_1/StatefulPartitionedCall/PartitionedCall/strided_slice_3/stack", "op": "Const", "input": ["^Func/StatefulPartitionedCall/random_forest_model_1/StatefulPartitionedCall/input_control_node/_4"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/random_forest_model_1/StatefulPartitionedCall/PartitionedCall/strided_slice_3/stack_1", "op": "Const", "input": ["^Func/StatefulPartitionedCall/random_forest_model_1/StatefulPartitionedCall/input_control_node/_4"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/random_forest_model_1/StatefulPartitionedCall/PartitionedCall/strided_slice_3/stack_2", "op": "Const", "input": ["^Func/StatefulPartitionedCall/random_forest_model_1/StatefulPartitionedCall/input_control_node/_4"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/random_forest_model_1/StatefulPartitionedCall/PartitionedCall/strided_slice_4/stack", "op": "Const", "input": ["^Func/StatefulPartitionedCall/random_forest_model_1/StatefulPartitionedCall/input_control_node/_4"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/random_forest_model_1/StatefulPartitionedCall/PartitionedCall/strided_slice_4/stack_1", "op": "Const", "input": ["^Func/StatefulPartitionedCall/random_forest_model_1/StatefulPartitionedCall/input_control_node/_4"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/random_forest_model_1/StatefulPartitionedCall/PartitionedCall/strided_slice_4/stack_2", "op": "Const", "input": ["^Func/StatefulPartitionedCall/random_forest_model_1/StatefulPartitionedCall/input_control_node/_4"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/random_forest_model_1/StatefulPartitionedCall/PartitionedCall/strided_slice_5/stack", "op": "Const", "input": ["^Func/StatefulPartitionedCall/random_forest_model_1/StatefulPartitionedCall/input_control_node/_4"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/random_forest_model_1/StatefulPartitionedCall/PartitionedCall/strided_slice_5/stack_1", "op": "Const", "input": ["^Func/StatefulPartitionedCall/random_forest_model_1/StatefulPartitionedCall/input_control_node/_4"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/random_forest_model_1/StatefulPartitionedCall/PartitionedCall/strided_slice_5/stack_2", "op": "Const", "input": ["^Func/StatefulPartitionedCall/random_forest_model_1/StatefulPartitionedCall/input_control_node/_4"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/random_forest_model_1/StatefulPartitionedCall/PartitionedCall/strided_slice_6/stack", "op": "Const", "input": ["^Func/StatefulPartitionedCall/random_forest_model_1/StatefulPartitionedCall/input_control_node/_4"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/random_forest_model_1/StatefulPartitionedCall/PartitionedCall/strided_slice_6/stack_1", "op": "Const", "input": ["^Func/StatefulPartitionedCall/random_forest_model_1/StatefulPartitionedCall/input_control_node/_4"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/random_forest_model_1/StatefulPartitionedCall/PartitionedCall/strided_slice_6/stack_2", "op": "Const", "input": ["^Func/StatefulPartitionedCall/random_forest_model_1/StatefulPartitionedCall/input_control_node/_4"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/random_forest_model_1/StatefulPartitionedCall/PartitionedCall/Cast", "op": "Cast", "input": ["input_1", "^Func/StatefulPartitionedCall/random_forest_model_1/StatefulPartitionedCall/input_control_node/_4"], "attr": {"SrcT": {"type": "DT_INT64"}, "Truncate": {"b": false}, "DstT": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/random_forest_model_1/StatefulPartitionedCall/PartitionedCall/strided_slice_7/stack", "op": "Const", "input": ["^Func/StatefulPartitionedCall/random_forest_model_1/StatefulPartitionedCall/input_control_node/_4"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/random_forest_model_1/StatefulPartitionedCall/PartitionedCall/strided_slice_7/stack_1", "op": "Const", "input": ["^Func/StatefulPartitionedCall/random_forest_model_1/StatefulPartitionedCall/input_control_node/_4"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/random_forest_model_1/StatefulPartitionedCall/PartitionedCall/strided_slice_7/stack_2", "op": "Const", "input": ["^Func/StatefulPartitionedCall/random_forest_model_1/StatefulPartitionedCall/input_control_node/_4"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/random_forest_model_1/StatefulPartitionedCall/Const", "op": "Const", "input": ["^Func/StatefulPartitionedCall/random_forest_model_1/StatefulPartitionedCall/input_control_node/_4"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{}, {}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/random_forest_model_1/StatefulPartitionedCall/Const_1", "op": "Const", "input": ["^Func/StatefulPartitionedCall/random_forest_model_1/StatefulPartitionedCall/input_control_node/_4"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{}, {}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/random_forest_model_1/StatefulPartitionedCall/RaggedConstant/values", "op": "Const", "input": ["^Func/StatefulPartitionedCall/random_forest_model_1/StatefulPartitionedCall/input_control_node/_4"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/random_forest_model_1/StatefulPartitionedCall/RaggedConstant/Const", "op": "Const", "input": ["^Func/StatefulPartitionedCall/random_forest_model_1/StatefulPartitionedCall/input_control_node/_4"], "attr": {"value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT64"}}}, {"name": "StatefulPartitionedCall/random_forest_model_1/StatefulPartitionedCall/RaggedConstant/Const_1", "op": "Const", "input": ["^Func/StatefulPartitionedCall/random_forest_model_1/StatefulPartitionedCall/input_control_node/_4"], "attr": {"value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT64"}}}, {"name": "StatefulPartitionedCall/random_forest_model_1/StatefulPartitionedCall/PartitionedCall_1/strided_slice/stack", "op": "Const", "input": ["^Func/StatefulPartitionedCall/random_forest_model_1/StatefulPartitionedCall/input_control_node/_4"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/random_forest_model_1/StatefulPartitionedCall/PartitionedCall_1/strided_slice/stack_1", "op": "Const", "input": ["^Func/StatefulPartitionedCall/random_forest_model_1/StatefulPartitionedCall/input_control_node/_4"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/random_forest_model_1/StatefulPartitionedCall/PartitionedCall_1/strided_slice/stack_2", "op": "Const", "input": ["^Func/StatefulPartitionedCall/random_forest_model_1/StatefulPartitionedCall/input_control_node/_4"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/random_forest_model_1/StatefulPartitionedCall/PartitionedCall/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/random_forest_model_1/StatefulPartitionedCall/PartitionedCall/Cast", "StatefulPartitionedCall/random_forest_model_1/StatefulPartitionedCall/PartitionedCall/strided_slice/stack", "StatefulPartitionedCall/random_forest_model_1/StatefulPartitionedCall/PartitionedCall/strided_slice/stack_1", "StatefulPartitionedCall/random_forest_model_1/StatefulPartitionedCall/PartitionedCall/strided_slice/stack_2"], "attr": {"shrink_axis_mask": {"i": "2"}, "begin_mask": {"i": "1"}, "ellipsis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "1"}, "T": {"type": "DT_FLOAT"}, "Index": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/random_forest_model_1/StatefulPartitionedCall/PartitionedCall/strided_slice_1", "op": "StridedSlice", "input": ["StatefulPartitionedCall/random_forest_model_1/StatefulPartitionedCall/PartitionedCall/Cast", "StatefulPartitionedCall/random_forest_model_1/StatefulPartitionedCall/PartitionedCall/strided_slice_1/stack", "StatefulPartitionedCall/random_forest_model_1/StatefulPartitionedCall/PartitionedCall/strided_slice_1/stack_1", "StatefulPartitionedCall/random_forest_model_1/StatefulPartitionedCall/PartitionedCall/strided_slice_1/stack_2"], "attr": {"shrink_axis_mask": {"i": "2"}, "begin_mask": {"i": "1"}, "ellipsis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "1"}, "Index": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/random_forest_model_1/StatefulPartitionedCall/PartitionedCall/strided_slice_2", "op": "StridedSlice", "input": ["StatefulPartitionedCall/random_forest_model_1/StatefulPartitionedCall/PartitionedCall/Cast", "StatefulPartitionedCall/random_forest_model_1/StatefulPartitionedCall/PartitionedCall/strided_slice_2/stack", "StatefulPartitionedCall/random_forest_model_1/StatefulPartitionedCall/PartitionedCall/strided_slice_2/stack_1", "StatefulPartitionedCall/random_forest_model_1/StatefulPartitionedCall/PartitionedCall/strided_slice_2/stack_2"], "attr": {"T": {"type": "DT_FLOAT"}, "Index": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "2"}, "begin_mask": {"i": "1"}, "ellipsis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "1"}}}, {"name": "StatefulPartitionedCall/random_forest_model_1/StatefulPartitionedCall/PartitionedCall/strided_slice_3", "op": "StridedSlice", "input": ["StatefulPartitionedCall/random_forest_model_1/StatefulPartitionedCall/PartitionedCall/Cast", "StatefulPartitionedCall/random_forest_model_1/StatefulPartitionedCall/PartitionedCall/strided_slice_3/stack", "StatefulPartitionedCall/random_forest_model_1/StatefulPartitionedCall/PartitionedCall/strided_slice_3/stack_1", "StatefulPartitionedCall/random_forest_model_1/StatefulPartitionedCall/PartitionedCall/strided_slice_3/stack_2"], "attr": {"shrink_axis_mask": {"i": "2"}, "begin_mask": {"i": "1"}, "ellipsis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "1"}, "Index": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/random_forest_model_1/StatefulPartitionedCall/PartitionedCall/strided_slice_4", "op": "StridedSlice", "input": ["StatefulPartitionedCall/random_forest_model_1/StatefulPartitionedCall/PartitionedCall/Cast", "StatefulPartitionedCall/random_forest_model_1/StatefulPartitionedCall/PartitionedCall/strided_slice_4/stack", "StatefulPartitionedCall/random_forest_model_1/StatefulPartitionedCall/PartitionedCall/strided_slice_4/stack_1", "StatefulPartitionedCall/random_forest_model_1/StatefulPartitionedCall/PartitionedCall/strided_slice_4/stack_2"], "attr": {"Index": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}, "shrink_axis_mask": {"i": "2"}, "ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "1"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "1"}}}, {"name": "StatefulPartitionedCall/random_forest_model_1/StatefulPartitionedCall/PartitionedCall/strided_slice_5", "op": "StridedSlice", "input": ["StatefulPartitionedCall/random_forest_model_1/StatefulPartitionedCall/PartitionedCall/Cast", "StatefulPartitionedCall/random_forest_model_1/StatefulPartitionedCall/PartitionedCall/strided_slice_5/stack", "StatefulPartitionedCall/random_forest_model_1/StatefulPartitionedCall/PartitionedCall/strided_slice_5/stack_1", "StatefulPartitionedCall/random_forest_model_1/StatefulPartitionedCall/PartitionedCall/strided_slice_5/stack_2"], "attr": {"shrink_axis_mask": {"i": "2"}, "begin_mask": {"i": "1"}, "ellipsis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "1"}, "T": {"type": "DT_FLOAT"}, "Index": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/random_forest_model_1/StatefulPartitionedCall/PartitionedCall/strided_slice_6", "op": "StridedSlice", "input": ["StatefulPartitionedCall/random_forest_model_1/StatefulPartitionedCall/PartitionedCall/Cast", "StatefulPartitionedCall/random_forest_model_1/StatefulPartitionedCall/PartitionedCall/strided_slice_6/stack", "StatefulPartitionedCall/random_forest_model_1/StatefulPartitionedCall/PartitionedCall/strided_slice_6/stack_1", "StatefulPartitionedCall/random_forest_model_1/StatefulPartitionedCall/PartitionedCall/strided_slice_6/stack_2"], "attr": {"shrink_axis_mask": {"i": "2"}, "begin_mask": {"i": "1"}, "ellipsis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "1"}, "T": {"type": "DT_FLOAT"}, "Index": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/random_forest_model_1/StatefulPartitionedCall/PartitionedCall/strided_slice_7", "op": "StridedSlice", "input": ["StatefulPartitionedCall/random_forest_model_1/StatefulPartitionedCall/PartitionedCall/Cast", "StatefulPartitionedCall/random_forest_model_1/StatefulPartitionedCall/PartitionedCall/strided_slice_7/stack", "StatefulPartitionedCall/random_forest_model_1/StatefulPartitionedCall/PartitionedCall/strided_slice_7/stack_1", "StatefulPartitionedCall/random_forest_model_1/StatefulPartitionedCall/PartitionedCall/strided_slice_7/stack_2"], "attr": {"T": {"type": "DT_FLOAT"}, "Index": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "2"}, "begin_mask": {"i": "1"}, "ellipsis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "1"}}}, {"name": "StatefulPartitionedCall/random_forest_model_1/StatefulPartitionedCall/stack", "op": "Pack", "input": ["StatefulPartitionedCall/random_forest_model_1/StatefulPartitionedCall/PartitionedCall/strided_slice", "StatefulPartitionedCall/random_forest_model_1/StatefulPartitionedCall/PartitionedCall/strided_slice_1", "StatefulPartitionedCall/random_forest_model_1/StatefulPartitionedCall/PartitionedCall/strided_slice_2", "StatefulPartitionedCall/random_forest_model_1/StatefulPartitionedCall/PartitionedCall/strided_slice_3", "StatefulPartitionedCall/random_forest_model_1/StatefulPartitionedCall/PartitionedCall/strided_slice_4", "StatefulPartitionedCall/random_forest_model_1/StatefulPartitionedCall/PartitionedCall/strided_slice_5", "StatefulPartitionedCall/random_forest_model_1/StatefulPartitionedCall/PartitionedCall/strided_slice_6", "StatefulPartitionedCall/random_forest_model_1/StatefulPartitionedCall/PartitionedCall/strided_slice_7"], "attr": {"T": {"type": "DT_FLOAT"}, "axis": {"i": "1"}, "N": {"i": "8"}}}, {"name": "StatefulPartitionedCall/random_forest_model_1/StatefulPartitionedCall/inference_op", "op": "SimpleMLInferenceOpWithHandle", "input": ["StatefulPartitionedCall/random_forest_model_1/StatefulPartitionedCall/stack", "StatefulPartitionedCall/random_forest_model_1/StatefulPartitionedCall/Const", "StatefulPartitionedCall/random_forest_model_1/StatefulPartitionedCall/Const_1", "StatefulPartitionedCall/random_forest_model_1/StatefulPartitionedCall/RaggedConstant/values", "StatefulPartitionedCall/random_forest_model_1/StatefulPartitionedCall/RaggedConstant/Const", "StatefulPartitionedCall/random_forest_model_1/StatefulPartitionedCall/RaggedConstant/Const_1", "unknown"], "attr": {"dense_output_dim": {"i": "2"}, "_has_manual_control_dependencies": {"b": true}}}, {"name": "StatefulPartitionedCall/random_forest_model_1/StatefulPartitionedCall/PartitionedCall_1/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/random_forest_model_1/StatefulPartitionedCall/inference_op", "StatefulPartitionedCall/random_forest_model_1/StatefulPartitionedCall/PartitionedCall_1/strided_slice/stack", "StatefulPartitionedCall/random_forest_model_1/StatefulPartitionedCall/PartitionedCall_1/strided_slice/stack_1", "StatefulPartitionedCall/random_forest_model_1/StatefulPartitionedCall/PartitionedCall_1/strided_slice/stack_2"], "attr": {"Index": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}, "shrink_axis_mask": {"i": "0"}, "begin_mask": {"i": "1"}, "ellipsis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "1"}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/random_forest_model_1/StatefulPartitionedCall/PartitionedCall_1/strided_slice"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 1286}}, "modelInitializer": {"node": [{"name": "Func/StatefulPartitionedCall/input_control_node/_0", "op": "NoOp", "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "609", "op": "Const", "attr": {"_has_manual_control_dependencies": {"b": true}, "value": {"tensor": {"dtype": "DT_STRING", "tensorShape": {}}}, "dtype": {"type": "DT_STRING"}}}, {"name": "Func/StatefulPartitionedCall/StatefulPartitionedCall/input_control_node/_8", "op": "NoOp", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/SimpleMLCreateModelResource", "op": "SimpleMLCreateModelResource", "input": ["^Func/StatefulPartitionedCall/StatefulPartitionedCall/input_control_node/_8"], "attr": {"container": {"s": ""}, "_has_manual_control_dependencies": {"b": true}, "shared_name": {"s": "c2ltcGxlX21sX21vZGVsXzQ2ZmZiYTFlLTIwYjMtNGZkYi1iNTZkLWZiMDRiOWU2ZTk3N19sb2FkXzE="}}}, {"name": "Func/StatefulPartitionedCall/StatefulPartitionedCall/output_control_node/_10", "op": "NoOp", "input": ["^StatefulPartitionedCall/StatefulPartitionedCall/SimpleMLCreateModelResource"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "Func/StatefulPartitionedCall/output_control_node/_2", "op": "NoOp", "input": ["^Func/StatefulPartitionedCall/StatefulPartitionedCall/output_control_node/_10"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/NoOp", "op": "NoOp", "input": ["^StatefulPartitionedCall/StatefulPartitionedCall/SimpleMLCreateModelResource"], "attr": {"_has_manual_control_dependencies": {"b": true}, "_acd_function_control_output": {"b": true}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/Identity", "op": "Identity", "input": ["StatefulPartitionedCall/StatefulPartitionedCall/SimpleMLCreateModelResource", "^StatefulPartitionedCall/StatefulPartitionedCall/NoOp"], "attr": {"T": {"type": "DT_RESOURCE"}}}, {"name": "Func/StatefulPartitionedCall/StatefulPartitionedCall/output/_9", "op": "Identity", "input": ["StatefulPartitionedCall/StatefulPartitionedCall/Identity"], "attr": {"T": {"type": "DT_RESOURCE"}}}, {"name": "StatefulPartitionedCall/NoOp", "op": "NoOp", "input": ["^Func/StatefulPartitionedCall/StatefulPartitionedCall/output_control_node/_10"], "attr": {"_acd_function_control_output": {"b": true}, "_has_manual_control_dependencies": {"b": true}}}, {"name": "StatefulPartitionedCall/Identity", "op": "Identity", "input": ["Func/StatefulPartitionedCall/StatefulPartitionedCall/output/_9", "^StatefulPartitionedCall/NoOp"], "attr": {"T": {"type": "DT_RESOURCE"}}}, {"name": "Func/StatefulPartitionedCall/output/_1", "op": "Identity", "input": ["StatefulPartitionedCall/Identity"], "attr": {"_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_RESOURCE"}}}, {"name": "Func/StatefulPartitionedCall_1/input_control_node/_3", "op": "NoOp", "input": ["^609", "^Func/StatefulPartitionedCall/output/_1"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "Func/StatefulPartitionedCall_1/input/_5", "op": "Identity", "input": ["Func/StatefulPartitionedCall/output/_1", "^Func/StatefulPartitionedCall_1/input_control_node/_3"], "attr": {"T": {"type": "DT_RESOURCE"}}}, {"name": "Func/StatefulPartitionedCall_1/StatefulPartitionedCall/input_control_node/_11", "op": "NoOp", "input": ["^Func/StatefulPartitionedCall_1/input_control_node/_3"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "Func/StatefulPartitionedCall_1/StatefulPartitionedCall/input/_13", "op": "Identity", "input": ["Func/StatefulPartitionedCall_1/input/_5", "^Func/StatefulPartitionedCall_1/StatefulPartitionedCall/input_control_node/_11"], "attr": {"T": {"type": "DT_RESOURCE"}}}, {"name": "Func/StatefulPartitionedCall_1/input/_4", "op": "Identity", "input": ["609", "^Func/StatefulPartitionedCall_1/input_control_node/_3"], "attr": {"T": {"type": "DT_STRING"}}}, {"name": "Func/StatefulPartitionedCall_1/StatefulPartitionedCall/input/_12", "op": "Identity", "input": ["Func/StatefulPartitionedCall_1/input/_4", "^Func/StatefulPartitionedCall_1/StatefulPartitionedCall/input_control_node/_11"], "attr": {"T": {"type": "DT_STRING"}}}, {"name": "StatefulPartitionedCall_1/StatefulPartitionedCall/StaticRegexReplace", "op": "StaticRegexReplace", "input": ["Func/StatefulPartitionedCall_1/StatefulPartitionedCall/input/_12"], "attr": {"pattern": {"s": "YzAwZWRkZDI0YTE2NDlmN2RvbmU="}, "rewrite": {"s": ""}, "replace_global": {"b": true}}}, {"name": "StatefulPartitionedCall_1/StatefulPartitionedCall/simple_ml/SimpleMLLoadModelFromPathWithHandle", "op": "SimpleMLLoadModelFromPathWithHandle", "input": ["Func/StatefulPartitionedCall_1/StatefulPartitionedCall/input/_13", "StatefulPartitionedCall_1/StatefulPartitionedCall/StaticRegexReplace"], "attr": {"output_types": {"list": {}}, "allow_slow_inference": {"b": true}, "_has_manual_control_dependencies": {"b": true}, "file_prefix": {"s": "YzAwZWRkZDI0YTE2NDlmNw=="}}}, {"name": "Func/StatefulPartitionedCall_1/StatefulPartitionedCall/output_control_node/_15", "op": "NoOp", "input": ["^StatefulPartitionedCall_1/StatefulPartitionedCall/simple_ml/SimpleMLLoadModelFromPathWithHandle"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "Func/StatefulPartitionedCall_1/output_control_node/_7", "op": "NoOp", "input": ["^Func/StatefulPartitionedCall_1/StatefulPartitionedCall/output_control_node/_15"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "NoOp", "op": "NoOp", "input": ["^Func/StatefulPartitionedCall/output_control_node/_2", "^Func/StatefulPartitionedCall_1/output_control_node/_7"], "attr": {"_has_manual_control_dependencies": {"b": true}, "_acd_function_control_output": {"b": true}}}, {"name": "Identity", "op": "Identity", "input": ["Func/StatefulPartitionedCall/output/_1", "^Func/StatefulPartitionedCall_1/output_control_node/_7", "^NoOp"], "attr": {"T": {"type": "DT_RESOURCE"}}}], "versions": {"producer": 1286}}, "initializerSignature": {"outputs": {"Identity:0": {"name": "Identity:0", "dtype": "DT_RESOURCE", "tensorShape": {}, "resourceId": 392}}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "StatefulPartitionedCall/random_forest_model_1/StatefulPartitionedCall/PartitionedCall/strided_slice/stack", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/random_forest_model_1/StatefulPartitionedCall/PartitionedCall/strided_slice/stack_1", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/random_forest_model_1/StatefulPartitionedCall/PartitionedCall/strided_slice/stack_2", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/random_forest_model_1/StatefulPartitionedCall/PartitionedCall/strided_slice_1/stack", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/random_forest_model_1/StatefulPartitionedCall/PartitionedCall/strided_slice_1/stack_1", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/random_forest_model_1/StatefulPartitionedCall/PartitionedCall/strided_slice_1/stack_2", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/random_forest_model_1/StatefulPartitionedCall/PartitionedCall/strided_slice_2/stack", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/random_forest_model_1/StatefulPartitionedCall/PartitionedCall/strided_slice_2/stack_1", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/random_forest_model_1/StatefulPartitionedCall/PartitionedCall/strided_slice_2/stack_2", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/random_forest_model_1/StatefulPartitionedCall/PartitionedCall/strided_slice_3/stack", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/random_forest_model_1/StatefulPartitionedCall/PartitionedCall/strided_slice_3/stack_1", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/random_forest_model_1/StatefulPartitionedCall/PartitionedCall/strided_slice_3/stack_2", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/random_forest_model_1/StatefulPartitionedCall/PartitionedCall/strided_slice_4/stack", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/random_forest_model_1/StatefulPartitionedCall/PartitionedCall/strided_slice_4/stack_1", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/random_forest_model_1/StatefulPartitionedCall/PartitionedCall/strided_slice_4/stack_2", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/random_forest_model_1/StatefulPartitionedCall/PartitionedCall/strided_slice_5/stack", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/random_forest_model_1/StatefulPartitionedCall/PartitionedCall/strided_slice_5/stack_1", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/random_forest_model_1/StatefulPartitionedCall/PartitionedCall/strided_slice_5/stack_2", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/random_forest_model_1/StatefulPartitionedCall/PartitionedCall/strided_slice_6/stack", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/random_forest_model_1/StatefulPartitionedCall/PartitionedCall/strided_slice_6/stack_1", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/random_forest_model_1/StatefulPartitionedCall/PartitionedCall/strided_slice_6/stack_2", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/random_forest_model_1/StatefulPartitionedCall/PartitionedCall/strided_slice_7/stack", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/random_forest_model_1/StatefulPartitionedCall/PartitionedCall/strided_slice_7/stack_1", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/random_forest_model_1/StatefulPartitionedCall/PartitionedCall/strided_slice_7/stack_2", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/random_forest_model_1/StatefulPartitionedCall/Const", "shape": [0, 0], "dtype": "float32"}, {"name": "StatefulPartitionedCall/random_forest_model_1/StatefulPartitionedCall/Const_1", "shape": [0, 0], "dtype": "int32"}, {"name": "StatefulPartitionedCall/random_forest_model_1/StatefulPartitionedCall/RaggedConstant/values", "shape": [0], "dtype": "int32"}, {"name": "StatefulPartitionedCall/random_forest_model_1/StatefulPartitionedCall/RaggedConstant/Const", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/random_forest_model_1/StatefulPartitionedCall/RaggedConstant/Const_1", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/random_forest_model_1/StatefulPartitionedCall/PartitionedCall_1/strided_slice/stack", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/random_forest_model_1/StatefulPartitionedCall/PartitionedCall_1/strided_slice/stack_1", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/random_forest_model_1/StatefulPartitionedCall/PartitionedCall_1/strided_slice/stack_2", "shape": [2], "dtype": "int32"}, {"name": "609", "shape": [], "dtype": "string"}]}]}